<?php
/**
 * User: 一根小腿毛@qq：1368213727
 * Created by PhpStorm.
 * User: windo
 * Date: 2019/3/2
 * Time: 15:17
 */
return [
    // +----------------------------------------------------------------------
    // | 应用设置
    // +----------------------------------------------------------------------
    'app'        => [
         //版本
        'version' => '3.0',
        // 应用调试模式
        'app_debug'              => true,
        //缓存时间
        'cache_time'             => '3600',
        //缓存类型
        'cache_type'             => 'local',
        //每页显示多少条
        'page_size'              => 20,
        //cooke加密项key
        'crypt_keys'             => "#1dj8$=dp?.ak//j1V$123",


        // +----------------------------------------------------------------------
        // | 模块设置
        // +----------------------------------------------------------------------
        // 默认模块名
        'default_module'         => 'index',
        // 默认cli模块名
        'default_cli_module'     => 'command',
        // 默认的空控制器名
        'empty_controller'       => 'Error',
        // 默认的空方法名
        'empty_action'           => 'error',
        // 默认的时区
        'timezone'               => 'Asia/Shanghai',


        // +----------------------------------------------------------------------
        // | 模板设置
        // +----------------------------------------------------------------------
        // 错误的模板自定义
        'error_template'         => CORE_PATH. DS ."template" . DS . "error.html",
        // 成功的模板自定义
        'success_template'       => CORE_PATH. DS ."template" . DS . "success.html",
        // 错误安全提示语录
        'error_message'          => "系统发生错误！请稍后再试或者联系管理员！",


    ],
    // +----------------------------------------------------------------------
    // | 数据库设置
    // +---------------------------------------------------------------------
    'database'   => [
        // 服务器地址
        'host'               => '',
        // 数据库名
        'dbname'             => '',
        // 数据库用户名
        'username'           => '',
        // 数据库密码
        'password'           => '',
        // 数据库表前缀
        'prefix'             => '',
        // 数据库连接端口
        'hostport'           => '3306',
        //数据库类型
        'adapter'            => 'Mysql',
        //数据库编码
        "charset"            => "utf8"
    ]

];
